{
  "blogs": [
    {
      "title": "Principles",
      "content": "Be as honest as possible.\nFollow your curiosity\nPractice Mindfulness.\n Close the feedback loop between idea and action.\nStart Now (Just do It)\nLearn How To learn\nEverything is figure-out-able\n Find balance of technology use (Digital Minimalism Cal Newport)\nUninstall Copes"
    },
    {
      "title": "Smart NPCs",
      "content": "Non-player characters (NPCs) in video games have been present since the earliest days of gaming. In early games, NPCs were often static and non-interactive, serving as little more than background decoration. As games became more advanced, developers began to incorporate more sophisticated NPCs that could interact with the player in various ways.\n\nOne of the earliest examples of interactive NPCs was in the game Ultima IV: Quest of the Avatar, released in 1985. This game featured a complex moral system that required the player to interact with NPCs in order to progress. The game's NPCs had their own unique personalities and motivations, and the player had to navigate complex social situations in order to complete their quest.\n\n\n\nIn the years since Ultima IV, game developers have continued to refine the concept of interactive NPCs. In many modern games, NPCs are an essential part of the gameplay experience, providing the player with quests, information, and other vital resources. With the advent of AI technology, developers are now able to create NPCs that are more intelligent, responsive, and lifelike than ever before.\n\nThe use of AI to create Smart NPCs represents a major advancement in the field of video game development. By simulating believable human behavior, these NPCs can provide players with a more immersive and engaging gameplay experience. As AI technology continues to improve, we can expect to see even more sophisticated NPCs in video games in the future.\n\nBelievable proxies of human behavior can empower interactive applications ranging from immersive environments to rehearsal spaces for interpersonal communication to prototyping tools. In a recent paper titled Generative Agents: Interactive Simulacra of Human Behavior, the authors introduce generative agents, which are computational software agents that simulate believable human behavior. These agents can wake up, cook breakfast, and head to work; artists paint, while authors write; they form opinions, notice each other, and initiate conversations; they remember and reflect on days past as they plan the next day. To enable generative agents, the authors describe an architecture that extends a large language model to store a complete record of the agents experiences using natural language, synthesize those memories over time into higher-level reflections, and retrieve them dynamically to plan behavior. The authors instantiate generative agents that populate an interactive sandbox environment inspired by The Sims, where end-users can interact with a small town of twenty-five agents using natural language. In an evaluation, these generative agents produce believable individual and emergent social behaviors.\n\n\n\nThe author explains that traditional game design involves creating a fixed narrative with predetermined outcomes. In contrast, using AI to create dynamic NPCs leads to a more open-ended and player-driven experience. \n\nIn the game, the player interacts with NPCs who have their own goals and motivations. The NPCs' behavior is not scripted but emerges from the game's underlying AI algorithms. This leads to unique interactions and storylines that are different for each player. The author suggests that this approach to game design could revolutionize the industry by creating games that are more engaging and replayable.If you’re building the integration layer for making Smart NPCs I’d love to chat: aryan@pacecapital.com"
    },
    {
      "title": "Copium",
      "content": "if you're using something as a substitute for emotional regulation its not a good idea.\n Learn to figure out how you're avoiding emotional regulation."
    }
  ]
}
