{
  "blogs": [
    {
      "title": "Principles",
      "content": "Be as honest as possible.\nFollow your curiosity\nPractice Mindfulness.\n Close the feedback loop between idea and action.\nStart Now (Just do It)\nLearn How To learn\nEverything is figure-out-able\n Find balance of technology use (Digital Minimalism Cal Newport)\nUninstall Copes\n Strive to be more agentic"
    },
    {
      "title": "Copium",
      "content": "If you're using something as a substitute for emotional regulation its not a good idea.\n Learn to figure out how you're avoiding emotional regulation.\n Copes often leave us in a worse place than we started in."
    },
    {
      "title": "Information Contagion and Echochambers", 
      "content": "Information contagion runs rampant in the startup and venture ecosystem and produces mediocre outcomes. As investors in the frontiers and fringes of technology, we are inherently supposed to invest in contrarian and/or non-consensus ideas to produce returns. Comically, investors are the most prone to groupthink. We are quick to recite talking points from the newest All-In Podcast or viral tweet. This happens in various echo chambers online and offline. This can also be extrapolated to advice given on the internet or by peers and mentors. These inputs should be weighted appropriately before applied and should not serve as a substitute for experience.\n\nBad information is worse than having no information. Reddit is heavily slanted towards groupthink via its upvote system self-selecting for consensus ideas to be seen first, therefore we should be cautious of information in an environment where ideas are ranked by the average (chronically online) Redditor.\n\nR/relationship advice is famously a terrible place for actual relationship advice. The same applies to Hacker News, another forum with an upvote system. Take for example: this comment on the Dropbox announcement on HN in 2007.\n\nAs of Aug. 2024, Dropbox sits at a market cap. of 7.92B. HN forgot that people just want something that works. When taking any advice, story, or anecdote, consider it a mimetic mind worm. A contagion that might impact you and also your closest nodes and further their nodes. Spreading from node to node from the moment you read a tweet and tell your friend about it.\n\nConsider all of CS lowbie Twitter building things from scratch in Zig, or all the doomers on r/csmajors or even incels. Or all the Notion and Obsidian influencers on YouTube.\n\nChronically online-ness creates echo chambers because instead of interacting with a more diverse cast of characters, the invisible hand of the algorithm selects for ideas that do well with the vector space that represents your online existence. That vector space also further determines who you interact with, selecting for people within your bubble.\n\n Thanks GK, PS, TO for reading early drafts"
    },
    {
      "title": "Joining Pace Capital",
      "content": "Finding my way to Pace: Becoming a professional rabbit-holer\n\nI've always found fall to be the true start of the new year, and some seem to agree—Diwali and Rosh Hashanah both being in the fall.\n\nI've also found that true in my life, the fall always seems to bring the unexpected. This fall was no different, as I left school and moved to NYC to join the Pace team full-time.\n\nPace is a five year old, $400M fund started by Chris Paik and Jordan Cooper. I'll be the fourth person on the investing team, working closely with both of them. We make very few investments per year and typically lead Seed and Series A financings.\n\nThe way I have and will continue to spend my time as an investor is largely a function of my interest in forums. I grew up on the internet at a time when independent forums were slowly on the way out in favor of more consolidated and commercialized forums - Discord, Reddit, and Twitter. Although I spent time on all of those platforms, I ended up spending a lot of time on a forum called sudomod similar to Palmer Luckey's modretro forum - a small forum dedicated to building, modding, and customizing gameboys. Diving into sudomod and other forums to find obscure knowledge became very addictive and soon I began digging other holes to go down into.\n\nAs a kid, I wanted to be an explorer and it upset me that the world had already been (mostly) discovered. I think that urge to explore, which has driven much of human progress, lies at the center of everything I do.\n\nI see venture investing through the lens of an anthropologist or an explorer, trying to uncover something hidden from the rest of the world, piecing it together, and marveling at its interconnectedness.\n\nI see the team at Pace as a group of explorers and for this reason, I am very excited to be spending more time with Chris, Jordan, and Grace practicing and studying the art of investing.\n\nIf this resonated feel free to reach out (I read every email) aryan@pacecapital.com"
    }
  ]
}
